renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_http_server_rx/src/r_http_server.c
static const uint8_t day_data[7][4] = {{"Sun"}, {"Mon"}, {"Tue"}, {"Wed"}, {"Thu"}, {"Fri"}, {"Sat"}};
static const uint8_t month_data[12][4] = {{"Jan"}, {"Feb"}, {"Mar"}, {"Apr"}, {"May"}, {"Jun"}, {"Jul"}, {"Aug"}, {"Sep"}, {"Oct"}, {"Nov"}, {"Dec"}};

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
HTTP_CEP http_cep[HTTP_TCP_CEP_NUM];
uint8_t lf_code[] = LF_CODE;
ER http_callback(ID cepid, FN fncd , VP p_parblk);

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
extern char _T4_Version[];

/*------------ PROCESS -----------*/

/******************************************************************************
* Function Name : R_httpd
* Description   : Watch the HTTP server status.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_httpd(void)
{
    ER   ercd;
    uint32_t  i;
    static int32_t init_flag = 0;

    /* Initialize process */
    if (init_flag == 0)
    {
        memset(http_cep, 0, sizeof(http_cep));
        init_flag = 1;
        for (i = 0; i < HTTP_TCP_CEP_NUM; i++)
        {
            http_cep[i].fileid = -1;
        }
    }

    /* This function checks all communication endpoint */
    for (i = 0; i < HTTP_TCP_CEP_NUM; i++)
    {
        switch (http_cep[i].status)
        {
            case HTTPD_CLOSED:
                /* accept */
                ercd = tcp_acp_cep(i + HTTP_START_TCP_CEP + 1, i + HTTP_START_TCP_CEP + 1, &http_cep[i].dstaddr, TMO_NBLK);
                if (ercd != E_WBLK)
                {
                    while (1);
                }
                http_cep[i].status = HTTPD_ACCEPT;
                break;
            case HTTPD_CGI_GEN_RESPONSE:
                if (cgi_file_name_table[http_cep[i].current_cgi_func_index].cgi_cb_func != NULL)
                {
                    ercd = cgi_file_name_table[ http_cep[i].current_cgi_func_index].cgi_cb_func(i + 1, &http_cep[i].res_info.res);

                    ercd = httpd_gen_response_cgi(i + 1, ercd);
                    if (ercd == 0)
                    {
                        /* start transmitting response header */
                        tcp_snd_dat(i + HTTP_START_TCP_CEP + 1, (VP)http_cep[i].res_info.res.hdr, http_cep[i].res_info.res.hdr_size, TMO_NBLK);
                        http_cep[i].status = HTTPD_SEND_RESPONSE_HEADER;
                        http_cep[i].now_data = 0;
                        http_cep[i].remain_data = http_cep[i].res_info.res.hdr_size;
                    }
                    else
                    {
                        /* no transmit when there is no body data */
                        http_cep[i].now_data = 0;
                        http_cep[i].remain_data = 0;
                        http_cep[i].status = HTTPD_CLOSING;
                        tcp_cls_cep(i + HTTP_START_TCP_CEP + 1, TMO_NBLK);
                    }
                }
                else
                {
                    while (1);
                }
            default:
                break;
        }
    }
}

void R_httpd_pending_release_request(ID cepid)
{
    if (cepid <= 0)
    {
        while (1);  /* System error !! */
    }

    http_cep[cepid-1].status = HTTPD_CGI_GEN_RESPONSE;
}

static ER httpd_gen_response_cgi(ID cepid, ER ercd)
{
    if (ercd < 0 || http_cep[cepid-1].res_info.res.body == 0 || http_cep[cepid-1].res_info.res.body_size == 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* generate response header */
    if (gen_response_cgi(cepid, http_cep[cepid-1].hdr_buff) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }
    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, strlen((char*)http_cep[cepid-1].body_buff), http_cep[cepid-1].body_buff);

    return 0;
}


static ER httpd_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, HTTPD_RESOURCE_INFO *res_info, ER rcv_dat_size)
{
    uint8_t *ptr;
    ER ercd;

    if (rcv_dat_size <= 0)
    {
        http_cep[cepid-1].total_rcv_len = 0;
        return -1;
    }

    http_cep[cepid-1].total_rcv_len += rcv_dat_size;

    if (http_cep[cepid-1].total_rcv_len > (buf_len - 1))
    {
        /* If buffer is full,do not receive. */
        http_cep[cepid-1].total_rcv_len = 0;
        return -1;
    }
    buf[http_cep[cepid-1].total_rcv_len] = '\0';

    ptr = (uint8_t *)strstr((char*)buf, "\r\n\r\n");
    if (ptr != 0)
    {
        *(ptr + 4) = '\0';
        http_cep[cepid-1].total_rcv_len = 0;
//  if (httpd_parse_request(cepid, buf, res_info) < 0)

        ercd = httpd_parse_request(cepid, buf, res_info);

        /* pend sending */
        if (ercd == -2)
        {
            return -2;
        }
        else if (ercd < 0)
        {
            return -1;
        }
        return 0;
    }

    /* continue receiving */
    return -3;
}


static ER httpd_parse_request(ID cepid, uint8_t *buf, HTTPD_RESOURCE_INFO *res_info)
{
    uint8_t  *p, *q;
    uint8_t  ch = 0;

    int8_t method_no = 0;
    uint8_t tmp_path[256];

    uint32_t i;
    ER ercd;

    memset(&res_info->res, 0, sizeof(HTTPD_RESOURCE));

    /* check method */
    method_no = method_check(buf);
    if (method_no == METHOD_ERR)
    {
        return httpd_parse_request_not_implemented(cepid);
    }
    if (method_no == METHOD_GET)
    {
        buf += (sizeof("GET ") - 1);
    }
    else
    {
        buf += (sizeof("HEAD ") - 1);
    }

