renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_http_server_rx/src/r_http_server.c
    p = buf;
    q = NULL;
    while (1)
    {
        ch = *p++;
        if (ch == ' ' || ch == '&')    /* first argument is only available */
        {
            *(p - 1) = '\0';
            break;
        }
        else if (ch == '?')
        {
            q = p;
        }
        else if (ch == '\0')
        {
            return httpd_parse_request_internal_server_error(cepid);
        }
    }
    if (q != NULL)
    {
        strncpy((char*)res_info->param, (const char*)q, QUERY_PARAM_SIZE - 1);
        res_info->param[QUERY_PARAM_SIZE-1] = '\0';
    }

    /* generate file path */
    tmp_path[0] = 0;
    strcat_with_check_len(tmp_path, (uint8_t*)httpd_root_directry, sizeof(tmp_path));
    strcat_with_check_len(tmp_path, (uint8_t*)buf, sizeof(tmp_path));

    /* case : specified directory */
    if ((uint8_t)(tmp_path[strlen((char*)tmp_path)-1]) == '/')
    {
        if (indexes == 0)
        {
            strcpy((char*)tmp_path, (const char *)httpd_root_directry);
            strcat((char*)tmp_path, (const char *)default_file_name);
        }
        else
        {
            /* generate indexes page */
            if (gen_response_indexes(cepid, (uint8_t*)tmp_path) == 0)
            {
                /* set response information */
                set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, strlen((char*)http_cep[cepid-1].body_buff), http_cep[cepid-1].body_buff);
                http_cep[cepid-1].res_info.res.type = RESTYPE_INDEXES;
                return 0;
            }
            else
            {
                return httpd_parse_request_internal_server_error(cepid);
            }
        }
    }
    if (is_request_cgi(tmp_path) != 0)
    {
        /* search resources */
        http_cep[cepid-1].fileid = file_open((uint8_t *)tmp_path, FILE_READ);
        if (http_cep[cepid-1].fileid < 0)
        {
            return httpd_parse_request_not_found(cepid);
        }
        get_file_info(http_cep[cepid-1].fileid, &http_cep[cepid-1].current_file_date_info);
        http_cep[cepid-1].res_info.res.type = RESTYPE_FILE;

        /* generate response header */
        if (gen_response_header(cepid, buf, http_cep[cepid-1].hdr_buff, get_file_size(http_cep[cepid-1].fileid)) < 0)
        {
            return httpd_parse_request_internal_server_error(cepid);
        }
        /* set response information */
        set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, get_file_size(http_cep[cepid-1].fileid), http_cep[cepid-1].body_buff);
        return 0;
    }

    else
    {
        /* serch resources for CGI */
        for (i = 0; i < MAX_CGI_FILE; i++)
        {
            if (strstr((const char*)tmp_path, (const char*)cgi_file_name_table[i].file_name))
            {
                break; // exist cgi file
            }
        }
        if (i == MAX_CGI_FILE)
        {
            return httpd_parse_request_not_found(cepid);
        }

        /* CGI fuction pointer null check */
        if (NULL == cgi_file_name_table[i].cgi_func)
        {
            return httpd_parse_request_not_found(cepid);
        }

        /* Regist CGI function */
        http_cep[cepid-1].res_info.res.type = RESTYPE_CGI;
        http_cep[cepid-1].res_info.res.cgi_func = cgi_file_name_table[i].cgi_func;
        http_cep[cepid-1].res_info.res.body = http_cep[cepid-1].body_buff;

        /* execute cgi function */
        ercd = (*http_cep[cepid-1].res_info.res.cgi_func)(cepid, &http_cep[cepid-1].res_info.res);

        /* -2: CGI pending */
        if (ercd == -2)
        {
            http_cep[cepid-1].current_cgi_func_index = i;
            return -2;
        }
        /* 0: Normal termination, -1: Internal error */
        else
        {
            ercd = httpd_gen_response_cgi(cepid, ercd);
        }

        return ercd;
    }

    /* erro path */
    return -1;
}

static ER httpd_parse_request_not_found(ID cepid)
{
    /* generate 404 Not Found response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_404) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;
}

/* default error */
static ER httpd_parse_request_internal_server_error(ID cepid)
{

    /* generate 500 Internal Server Error response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_500) < 0)
    {
        return -1;
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;
}

static ER httpd_parse_request_not_implemented(ID cepid)
{
    /* generate 501 Not Implemented response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_501) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;

}

static ER method_check(uint8_t *buf)
{

    int8_t ret = METHOD_ERR;

    if (strncmp((char*)buf, "GET ", 4) == 0)
    {
        ret = METHOD_GET;
    }
    if (strncmp((char*)buf, "HEAD ", 5) == 0)
    {
        ret = METHOD_HEAD;
    }
    return ret;
}


static ER extension_check(uint8_t *buf)
{

    int16_t loop;
    int32_t ret;
    uint8_t tmp_extension[4];

    tmp_extension[0] = (uint8_t)tolower((int32_t) * buf);
    tmp_extension[1] = (uint8_t)tolower((int32_t) * (buf + 1));
    tmp_extension[2] = (uint8_t)tolower((int32_t) * (buf + 2));
    tmp_extension[3] = 0;

    for (loop = 0; loop < MAX_EXTENSION; loop++)
    {
        if (strcmp((const char*)tmp_extension, (const char *)extension_data[loop].extension_type) == 0)
        {
            ret = loop;
            break;
        }
    }
    if (loop == MAX_EXTENSION)
    {
        ret = 0;
    }
    return ret;
}


static ER set_allow(uint8_t *buf)
{
    sprintf((char *)buf, "Allow: GET, HEAD\r\n");
    return(12);
}

static ER set_content_length(uint32_t content_size, uint8_t *buf)
{
    sprintf((char *)buf, "Content-Length: %d\r\n", content_size);

    return strlen((const char *)buf);

