renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_http_server_rx/src/r_http_server.c
}

static ER set_content_type(int16_t extension_no, uint8_t *buf)
{
    if (extension_no < 0)
    {
        return -1;
    }

    sprintf((char *)buf, "Content-Type: %s\r\n", &extension_data[extension_no].content_type_buf[0]);

    return strlen((const char *)buf);

}

static ER set_lastmodified_date(ID cepid, uint8_t *buf, DATE_INFO *date_info)
{
    sprintf((char *)buf, "Last-Modified: %s, %d %s %02d %02d:%02d:%02d GMT\r\n",
            date_info->day_of_the_week,
            date_info->day,
            date_info->month,
            date_info->year,
            date_info->hour,
            date_info->min,
            date_info->sec
           );
    return 0;
}

static ER set_http_resource(ID cepid, uint32_t hdr_size, uint8_t *hdr_buff, uint32_t body_size, uint8_t *body_buff)
{
    http_cep[cepid-1].res_info.res.hdr_size = hdr_size;
    http_cep[cepid-1].res_info.res.hdr = hdr_buff;
    http_cep[cepid-1].res_info.res.body_size = body_size;
    http_cep[cepid-1].res_info.res.body = body_buff;
    return 0;
}

static ER get_extension_no(uint8_t *buf)
{
    ER extension_no;
    uint8_t *ptr;

    ptr = (uint8_t *)strchr((char*)buf, '.');
    extension_no = extension_check(ptr + 1);
    return extension_no;

}

static ER gen_response_header(ID cepid, uint8_t *uri, uint8_t *buf, uint32_t content_length)
{
    uint8_t tmp_buf[128];
    uint8_t crlf[] = "\r\n";
    ER ercd = 0;

    buf[0] = 0;

    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Allow:
    set_allow(tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Last-Modified:
    set_lastmodified_date(cepid, tmp_buf, &http_cep[cepid-1].current_file_date_info);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Content-Type:
    set_content_type(get_extension_no((uint8_t *)uri), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Content-Length:
    set_content_length(content_length, tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // End of header
    ercd += strcat_with_check_len((uint8_t*)buf, crlf, HDR_BUF_SIZE);

    return 0;
}

static ER gen_response_error_header(uint8_t *buf, int32_t error_code)
{
    uint8_t tmp_buf[128];
    uint8_t crlf[] = "\r\n";
    ER ercd = 0;

    buf[0] = 0;

    switch (error_code)
    {
        case HTTP_ERROR_CODE_404:
            sprintf((char *)tmp_buf, "HTTP/1.0 404 Not Found\r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;

        case HTTP_ERROR_CODE_500:
            sprintf((char *)tmp_buf, "HTTP/1.0 500 Internal Server Error\r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;

        case HTTP_ERROR_CODE_501:
            sprintf((char *)tmp_buf, "HTTP/1.0 501 Not Implemented \r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;
    }

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // End of header
    ercd += strcat_with_check_len((uint8_t*)buf, crlf, HDR_BUF_SIZE);

    return ercd;
}


static ER align_file_name_space(const uint8_t *src, uint8_t *dst, uint8_t **space)
{
    static const uint8_t c_space[SNAME_LEN+1] = "            ";
    int32_t src_len;

    src_len = strlen((const char *)src);
    if (src_len > SNAME_LEN)
    {
        strncpy((char *)dst, (const char *)src, SNAME_LIMIT_LEN);
        dst[SNAME_LIMIT_LEN+1] = '~';
        dst[SNAME_LIMIT_LEN+1] = src[src_len-1];
        *space = (uint8_t *) & c_space[SNAME_LEN-1];
    }
    else
    {
        strcpy((char *)dst, (const char *)src);
        *space = (uint8_t *) & c_space[src_len];
    }

    return 0;
}

static ER gen_response_indexes(ID cepid, uint8_t *dir_name)
{
    uint8_t tmp_buf[512];
    uint8_t parent_dir_name[256];
    uint8_t crlf[] = "\r\n";
    int32_t i = 0;
    uint8_t shortname[13];
    uint8_t *p_space;
    ER ercd = 0;
    uint8_t *user_path;
    int32_t filenum;

    http_cep[cepid-1].hdr_buff[0] = 0;
    http_cep[cepid-1].body_buff[0] = 0;

    // generate body
    filenum = get_file_list_info((uint8_t *)dir_name, http_cep[cepid-1].file_list, HTTP_MAX_FILE_LIST, 0);
    if (filenum < 0)
    {
        return -1;
    }

    sprintf((char *)tmp_buf, "<html>%s<body>%s<pre>%s", lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    user_path = (uint8_t *)strstr((const char *)dir_name, (const char *)httpd_root_directry);
    user_path += strlen((const char *)httpd_root_directry);
    sprintf((char *)tmp_buf, "Index of %s %s%s", user_path, lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "        Name            Last modified       Size%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "<hr>%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    /* display parent directory */
    if (strlen((const char *)user_path) != 1)
    {
        strcpy((char *)parent_dir_name, (const char *)user_path);
        parent_dir_name[strlen((const char *)parent_dir_name)-1] = 0;
        *(strrchr((const char *)parent_dir_name, '/')) = 0;
        sprintf((char *)tmp_buf, "<a href=%s/>Parent Directory</a> ", parent_dir_name);
        ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
        /* line feed code */
        sprintf((char *)tmp_buf, "%s", lf_code);
        ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
    }

