renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_http_server_rx/src/r_http_server.c
    while (i < HTTP_MAX_FILE_LIST)
    {
        if (http_cep[cepid-1].file_list[i].file_name[0] == 0)
        {
            break;
        }
        else
        {
            /* directory name */
            if ((http_cep[cepid-1].file_list[i].file_attr & FILE_ATTR_DIR) == FILE_ATTR_DIR)
            {
                align_file_name_space((const uint8_t *)http_cep[cepid-1].file_list[i].file_name, shortname, &p_space);
                sprintf((char *)tmp_buf, "<a href=%s%s/>%s</a>%s     ", user_path, http_cep[cepid-1].file_list[i].file_name, shortname, p_space);
            }
            /* file name */
            else
            {
                align_file_name_space((const uint8_t *)http_cep[cepid-1].file_list[i].file_name, shortname, &p_space);
                sprintf((char *)tmp_buf, "<a href=%s%s>%s</a>%s     ", user_path, http_cep[cepid-1].file_list[i].file_name, shortname, p_space);

            }
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* Last modified */
            sprintf((char *)tmp_buf, "%2d-%s-%02d %02d:%02d:%02d ",
                    http_cep[cepid-1].file_list[i].date_info.day,
                    http_cep[cepid-1].file_list[i].date_info.month,
                    http_cep[cepid-1].file_list[i].date_info.year,
                    http_cep[cepid-1].file_list[i].date_info.hour,
                    http_cep[cepid-1].file_list[i].date_info.min,
                    http_cep[cepid-1].file_list[i].date_info.sec
                   );
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* directory disp */
            if ((http_cep[cepid-1].file_list[i].file_attr & FILE_ATTR_DIR) == FILE_ATTR_DIR)
            {
                sprintf((char *)tmp_buf, "     (dir)");
            }
            /* file size disp*/
            else
            {
                sprintf((char *)tmp_buf, "%10ld", http_cep[cepid-1].file_list[i].file_size);
            }
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* line feed code */
            sprintf((char *)tmp_buf, "%s", lf_code);
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
        }
        i++;
    }

    sprintf((char *)tmp_buf, "<hr>%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "%s", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "</pre>%s</body>%s</html>", lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    // generate header
    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Content-Length:
    set_content_length(strlen((char*)http_cep[cepid-1].body_buff), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // End of header
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, crlf, sizeof(http_cep[cepid-1].hdr_buff));

    return ercd;
}

static ER gen_response_cgi(ID cepid, uint8_t *buf)
{
    ER ercd = 0;
    uint8_t tmp_buf[256];
    uint8_t crlf[] = "\r\n";

    buf[0] = 0;

    // generate header
    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Content-Length:
    set_content_length(strlen((char*)http_cep[cepid-1].body_buff), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // End of header
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, crlf, sizeof(http_cep[cepid-1].hdr_buff));

    return ercd;
}

static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size)
{
    if (strlen((const char *)src) + strlen((const char *)concat) >= size)
    {
        return -1;
    }
    strcat((char *)src, (const char *)concat);
    return 0;
}

static ER is_request_cgi(uint8_t *buf)
{
    char *strstr_return;
    ER return_value;

    strstr_return = strstr((const char*)buf, (const char *)".cgi");

    if (strstr_return == 0)
    {
        return_value = -1;
    }
    else
    {
        return_value = 0;
    }
    return return_value;
}

static uint8_t *get_time(void)
{
    static uint8_t date[] = {"Mon, 07 Feb 2011 12:00:00 GMT"};
    SYS_TIME ptime;

